-----------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\eshak\OneDrive\Documents\23 Fall\Large Scale Data\finalproject2009.log
  log type:  text
 opened on:   6 Dec 2023, 15:06:40

. 
. /*----------------------------------
> Replicate Lutfiyya et al. (2011)
> -----------------------------------*/
. 
. **************************************
. ** Bring in BRFSS data            
. **************************************
. import sasxport5 CDBRFS09.XPT

. 
. *************************************
. ** Apply survey weight
. *************************************
. svyset _psu [pweight=_finalwt], strata(_ststr) singleunit(centered)

Sampling weights: _finalwt
             VCE: linearized
     Single unit: centered
        Strata 1: _ststr
 Sampling unit 1: _psu
           FPC 1: <zero>

. 
. **************************************
. ** Clean and create key variables            
. **************************************
. *keep variables for population of interest
. keep if age>=65
(296,337 observations deleted)

. tab diabete2, missing

  EVER TOLD |
  BY DOCTOR |
   YOU HAVE |
   DIABETES |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     26,172       19.21       19.21
          2 |        282        0.21       19.41
          3 |    106,687       78.29       97.70
          4 |      2,971        2.18       99.88
          7 |        114        0.08       99.97
          9 |         44        0.03      100.00
------------+-----------------------------------
      Total |    136,270      100.00

. keep if diabete2==1
(110,098 observations deleted)

. *create binary variable for rural and non-rural
. tab mscode, missing

METROPOLITA |
   N STATUS |
       CODE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,806       29.83       29.83
          2 |      5,190       19.83       49.66
          3 |      3,149       12.03       61.69
          4 |        123        0.47       62.16
          5 |      9,147       34.95       97.11
          . |        757        2.89      100.00
------------+-----------------------------------
      Total |     26,172      100.00

. drop if mscode==.
(757 observations deleted)

. gen rural = mscode==4 | mscode==5

. tab rural

      rural |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     16,145       63.53       63.53
          1 |      9,270       36.47      100.00
------------+-----------------------------------
      Total |     25,415      100.00

. *cleaning glucose test var
. tab bldsugar, missing

  HOW OFTEN |
CHECK BLOOD |
FOR GLUCOSE |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      4,926       19.38       19.38
        102 |      3,397       13.37       32.75
        103 |      1,300        5.12       37.86
        104 |        784        3.08       40.95
        105 |        152        0.60       41.55
        106 |         77        0.30       41.85
        107 |         35        0.14       41.99
        108 |         11        0.04       42.03
        109 |          2        0.01       42.04
        110 |          8        0.03       42.07
        112 |          2        0.01       42.08
        113 |          1        0.00       42.08
        120 |          3        0.01       42.09
        123 |          1        0.00       42.10
        131 |          1        0.00       42.10
        199 |          1        0.00       42.11
        201 |        817        3.21       45.32
        202 |        671        2.64       47.96
        203 |        885        3.48       51.44
        204 |        386        1.52       52.96
        205 |        125        0.49       53.45
        206 |         47        0.18       53.64
        207 |         82        0.32       53.96
        208 |          6        0.02       53.98
        209 |          1        0.00       53.99
        210 |         14        0.06       54.04
        212 |          6        0.02       54.07
        214 |          1        0.00       54.07
        215 |          2        0.01       54.08
        220 |          1        0.00       54.08
        231 |          1        0.00       54.09
        233 |          1        0.00       54.09
        301 |        322        1.27       55.36
        302 |        183        0.72       56.08
        303 |         58        0.23       56.31
        304 |         27        0.11       56.41
        305 |         24        0.09       56.51
        306 |          5        0.02       56.53
        307 |          2        0.01       56.53
        308 |          3        0.01       56.55
        310 |         18        0.07       56.62
        312 |          2        0.01       56.62
        314 |          1        0.00       56.63
        315 |         36        0.14       56.77
        316 |          1        0.00       56.77
        320 |          6        0.02       56.80
        325 |          7        0.03       56.82
        328 |          1        0.00       56.83
        330 |          7        0.03       56.86
        331 |          1        0.00       56.86
        332 |          1        0.00       56.86
        335 |          1        0.00       56.87
        340 |          2        0.01       56.88
        345 |          1        0.00       56.88
        360 |          1        0.00       56.88
        401 |         43        0.17       57.05
        402 |         70        0.28       57.33
        403 |         39        0.15       57.48
        404 |        111        0.44       57.92
        405 |         10        0.04       57.96
        406 |         17        0.07       58.02
        408 |          4        0.02       58.04
        410 |          4        0.02       58.06
        412 |          4        0.02       58.07
        413 |          1        0.00       58.08
        415 |          3        0.01       58.09
        425 |          1        0.00       58.09
        465 |          1        0.00       58.10
        475 |          1        0.00       58.10
        499 |          1        0.00       58.10
        777 |        265        1.04       59.15
        888 |      1,387        5.46       64.60
        999 |         41        0.16       64.76
          . |      8,955       35.24      100.00
------------+-----------------------------------
      Total |     25,415      100.00

. drop if bldsugar==777 | bldsugar==999 | bldsugar==.
(9,261 observations deleted)

. gen glucosetest = bldsugar

. replace glucosetest = 1 if bldsugar<888
(14,767 real changes made)

. replace glucosetest = 0 if bldsugar==888
(1,387 real changes made)

. tab glucosetest, missing

glucosetest |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,387        8.59        8.59
          1 |     14,767       91.41      100.00
------------+-----------------------------------
      Total |     16,154      100.00

. *cleaning self foot check var
. tab feetchk2, missing

  HOW OFTEN |
 CHECK FEET |
  FOR SORES |
  OR IRRITA |      Freq.     Percent        Cum.
------------+-----------------------------------
        101 |      9,539       59.05       59.05
        102 |        657        4.07       63.12
        103 |        101        0.63       63.74
        104 |         22        0.14       63.88
        105 |         40        0.25       64.13
        106 |          3        0.02       64.15
        107 |         36        0.22       64.37
        108 |          5        0.03       64.40
        110 |          2        0.01       64.41
        111 |          1        0.01       64.42
        112 |          2        0.01       64.43
        115 |          1        0.01       64.44
        120 |          1        0.01       64.44
        130 |          1        0.01       64.45
        199 |          3        0.02       64.47
        201 |      1,015        6.28       70.75
        202 |        496        3.07       73.82
        203 |        493        3.05       76.87
        204 |        225        1.39       78.27
        205 |        120        0.74       79.01
        206 |         32        0.20       79.21
        207 |        235        1.45       80.66
        208 |          2        0.01       80.67
        209 |          2        0.01       80.69
        210 |          1        0.01       80.69
        212 |          1        0.01       80.70
        213 |          1        0.01       80.70
        217 |          1        0.01       80.71
        301 |        338        2.09       82.80
        302 |        130        0.80       83.61
        303 |         43        0.27       83.87
        304 |         22        0.14       84.01
        305 |          5        0.03       84.04
        306 |          2        0.01       84.05
        308 |          3        0.02       84.07
        310 |         15        0.09       84.16
        312 |          1        0.01       84.17
        313 |          1        0.01       84.18
        315 |         22        0.14       84.31
        318 |          1        0.01       84.32
        320 |          6        0.04       84.36
        325 |          4        0.02       84.38
        328 |          2        0.01       84.39
        330 |         16        0.10       84.49
        331 |          1        0.01       84.50
        360 |          1        0.01       84.51
        365 |          1        0.01       84.51
        399 |          1        0.01       84.52
        401 |         34        0.21       84.73
        402 |         39        0.24       84.97
        403 |         13        0.08       85.05
        404 |         71        0.44       85.49
        405 |         10        0.06       85.55
        406 |         35        0.22       85.77
        407 |          1        0.01       85.77
        408 |          4        0.02       85.80
        409 |          1        0.01       85.81
        411 |          1        0.01       85.81
        412 |          2        0.01       85.82
        420 |          1        0.01       85.83
        430 |          1        0.01       85.84
        435 |          1        0.01       85.84
        450 |          1        0.01       85.85
        475 |          1        0.01       85.85
        499 |          2        0.01       85.87
        555 |        161        1.00       86.86
        777 |        426        2.64       89.50
        888 |      1,659       10.27       99.77
        999 |         37        0.23      100.00
------------+-----------------------------------
      Total |     16,154      100.00

. drop if feetchk2==999 | feetchk2==777 | feetchk2==555 | feetchk2==.
(624 observations deleted)

. gen footcheck = feetchk2

. replace footcheck=1 if feetchk2<555
(13,871 real changes made)

. replace footcheck=0 if feetchk2==888
(1,659 real changes made)

. tab footcheck, missing

  footcheck |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,659       10.68       10.68
          1 |     13,871       89.32      100.00
------------+-----------------------------------
      Total |     15,530      100.00

. *creating and cleaning blood pressure var
. gen controlledbp = .
(15,530 missing values generated)

. tab _rfhype5, missing

 HIGH BLOOD |
   PRESSURE |
 CALCULATED |
   VARIABLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,637       23.42       23.42
          2 |     11,844       76.27       99.68
          9 |         49        0.32      100.00
------------+-----------------------------------
      Total |     15,530      100.00

. drop if _rfhype5==9
(49 observations deleted)

. tab bpmeds, missing

  CURRENTLY |
     TAKING |
      BLOOD |
   PRESSURE |
   MEDICATI |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     11,351       73.32       73.32
          2 |        462        2.98       76.31
          7 |         31        0.20       76.51
          . |      3,637       23.49      100.00
------------+-----------------------------------
      Total |     15,481      100.00

. drop if bpmeds==9 | bpmeds==7 | bpmeds==.
(3,668 observations deleted)

. replace controlledbp = 1 if [_rfhype5==2 & bpmeds==1] | _rfhype5==1
(11,351 real changes made)

. replace controlledbp = 0 if _rfhype5==2 & bpmeds==2
(462 real changes made)

. tab controlledbp, missing

controlledb |
          p |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        462        3.91        3.91
          1 |     11,351       96.09      100.00
------------+-----------------------------------
      Total |     11,813      100.00

. *cleaning cholesterol check var
. tab cholchk, missing

   HOW LONG |
      SINCE |
CHOLESTEROL |
    CHECKED |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |     10,791       91.35       91.35
          2 |        302        2.56       93.91
          3 |         91        0.77       94.68
          4 |         46        0.39       95.06
          7 |        178        1.51       96.57
          9 |          2        0.02       96.59
          . |        403        3.41      100.00
------------+-----------------------------------
      Total |     11,813      100.00

. drop if cholchk==7 | cholchk==9 | cholchk==.
(583 observations deleted)

. gen cholesterol=.
(11,230 missing values generated)

. replace cholesterol = 1 if cholchk==1
(10,791 real changes made)

. replace cholesterol = 0 if cholchk>1
(439 real changes made)

. tab cholesterol, missing

cholesterol |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        439        3.91        3.91
          1 |     10,791       96.09      100.00
------------+-----------------------------------
      Total |     11,230      100.00

. *cleaning flu shot var
. tab _flshot3, missing

   FLU SHOT |
 CALCULATED |
   VARIABLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,247       73.44       73.44
          2 |      2,757       24.55       97.99
          9 |        226        2.01      100.00
------------+-----------------------------------
      Total |     11,230      100.00

. keep if _flshot3==1 | _flshot3==2
(226 observations deleted)

. gen flushot = .
(11,004 missing values generated)

. replace flushot = 1 if _flshot3==1
(8,247 real changes made)

. replace flushot = 0 if _flshot3>1
(2,757 real changes made)

. tab flushot, missing

    flushot |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,757       25.05       25.05
          1 |      8,247       74.95      100.00
------------+-----------------------------------
      Total |     11,004      100.00

. *cleaning pneumonia vax var
. tab pneuvac3, missing

  PNEUMONIA |
  SHOT EVER |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      8,358       75.95       75.95
          2 |      2,359       21.44       97.39
          7 |        277        2.52       99.91
          . |         10        0.09      100.00
------------+-----------------------------------
      Total |     11,004      100.00

. drop if pneuvac3==7 | pneuvac3==9 | pneuvac3==.
(287 observations deleted)

. gen pneumonia=.
(10,717 missing values generated)

. replace pneumonia = 1 if pneuvac3==1
(8,358 real changes made)

. replace pneumonia = 0 if pneuvac3==2
(2,359 real changes made)

. tab pneumonia, missing

  pneumonia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,359       22.01       22.01
          1 |      8,358       77.99      100.00
------------+-----------------------------------
      Total |     10,717      100.00

. *cleaning diabetes checks var
. tab doctdiab, missing

 TIMES SEEN |
     HEALTH |
PROFESSIONA |
L FOR DIABE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,115       10.40       10.40
          2 |      1,777       16.58       26.99
          3 |      1,385       12.92       39.91
          4 |      3,285       30.65       70.56
          5 |        210        1.96       72.52
          6 |        490        4.57       77.09
          7 |         62        0.58       77.67
          8 |         85        0.79       78.46
          9 |         29        0.27       78.73
         10 |         85        0.79       79.53
         11 |          7        0.07       79.59
         12 |        472        4.40       84.00
         13 |          7        0.07       84.06
         14 |          5        0.05       84.11
         15 |         25        0.23       84.34
         16 |          8        0.07       84.42
         17 |          1        0.01       84.43
         18 |          3        0.03       84.45
         19 |          1        0.01       84.46
         20 |         16        0.15       84.61
         22 |          2        0.02       84.63
         23 |          1        0.01       84.64
         24 |         31        0.29       84.93
         25 |          8        0.07       85.01
         26 |          2        0.02       85.02
         28 |          2        0.02       85.04
         30 |         13        0.12       85.16
         33 |          2        0.02       85.18
         36 |          7        0.07       85.25
         40 |          4        0.04       85.29
         43 |          2        0.02       85.30
         44 |          1        0.01       85.31
         48 |          7        0.07       85.38
         50 |          2        0.02       85.40
         51 |          1        0.01       85.41
         52 |         14        0.13       85.54
         54 |          2        0.02       85.56
         60 |          2        0.02       85.57
         75 |          2        0.02       85.59
         76 |         13        0.12       85.71
         77 |        331        3.09       88.80
         88 |      1,180       11.01       99.81
         99 |         20        0.19      100.00
------------+-----------------------------------
      Total |     10,717      100.00

. drop if doctdiab==77 | doctdiab==99 | doctdiab==.
(351 observations deleted)

. gen diacheck = .
(10,366 missing values generated)

. replace diacheck = 1 if doctdiab>=2
(9,251 real changes made)

. replace diacheck = 0 if doctdiab==88 | doctdiab==1
(2,295 real changes made)

. tab diacheck, missing

   diacheck |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,295       22.14       22.14
          1 |      8,071       77.86      100.00
------------+-----------------------------------
      Total |     10,366      100.00

. *cleaning a one c checks var 
. tab chkhemo3, missing

      TIMES |
CHECKED FOR |
GLYCOSYLATE |
D HEMOGLOBI |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,306       12.60       12.60
          2 |      2,303       22.22       34.82
          3 |      1,363       13.15       47.96
          4 |      2,689       25.94       73.91
          5 |        117        1.13       75.03
          6 |        190        1.83       76.87
          7 |         18        0.17       77.04
          8 |         31        0.30       77.34
          9 |          4        0.04       77.38
         10 |         25        0.24       77.62
         11 |          4        0.04       77.66
         12 |        136        1.31       78.97
         13 |          1        0.01       78.98
         14 |          2        0.02       79.00
         15 |          8        0.08       79.08
         17 |          3        0.03       79.10
         18 |          1        0.01       79.11
         20 |          5        0.05       79.16
         22 |          1        0.01       79.17
         24 |         12        0.12       79.29
         25 |          3        0.03       79.32
         30 |          6        0.06       79.37
         32 |          1        0.01       79.38
         36 |          1        0.01       79.39
         43 |          1        0.01       79.40
         48 |          3        0.03       79.43
         50 |          1        0.01       79.44
         52 |          3        0.03       79.47
         76 |          5        0.05       79.52
         77 |        772        7.45       86.97
         88 |        631        6.09       93.05
         98 |        698        6.73       99.79
         99 |         19        0.18       99.97
          . |          3        0.03      100.00
------------+-----------------------------------
      Total |     10,366      100.00

. drop if chkhemo3>=98
(720 observations deleted)

. gen a1c = .
(9,646 missing values generated)

. replace a1c = 1 if chkhemo3>=2
(8,340 real changes made)

. replace a1c = 0 if chkhemo3==88 | chkhemo3==1
(1,937 real changes made)

. tab a1c, missing

        a1c |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,937       20.08       20.08
          1 |      7,709       79.92      100.00
------------+-----------------------------------
      Total |      9,646      100.00

. *cleaning feet check by healthcare prof var
. tab feetchk, missing

 TIMES FEET |
  CHECK FOR |
SORES/IRRIT |
     ATIONS |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,778       18.43       18.43
          2 |      1,576       16.34       34.77
          3 |        917        9.51       44.28
          4 |      1,909       19.79       64.07
          5 |        144        1.49       65.56
          6 |        436        4.52       70.08
          7 |         36        0.37       70.45
          8 |         62        0.64       71.10
          9 |         18        0.19       71.28
         10 |         44        0.46       71.74
         11 |          6        0.06       71.80
         12 |        235        2.44       74.24
         13 |          3        0.03       74.27
         14 |          5        0.05       74.32
         15 |         10        0.10       74.42
         16 |          2        0.02       74.45
         17 |          1        0.01       74.46
         18 |          4        0.04       74.50
         19 |          1        0.01       74.51
         20 |         14        0.15       74.65
         23 |          1        0.01       74.66
         24 |         19        0.20       74.86
         25 |          1        0.01       74.87
         26 |          5        0.05       74.92
         30 |          5        0.05       74.97
         36 |          2        0.02       74.99
         40 |          1        0.01       75.01
         43 |          1        0.01       75.02
         44 |          1        0.01       75.03
         45 |          1        0.01       75.04
         47 |          1        0.01       75.05
         48 |          8        0.08       75.13
         50 |          3        0.03       75.16
         51 |          1        0.01       75.17
         52 |         12        0.12       75.30
         60 |          1        0.01       75.31
         72 |          1        0.01       75.32
         75 |          2        0.02       75.34
         76 |         14        0.15       75.48
         77 |        186        1.93       77.41
         88 |      2,162       22.41       99.82
         99 |         16        0.17       99.99
          . |          1        0.01      100.00
------------+-----------------------------------
      Total |      9,646      100.00

. drop if feetchk==77 | feetchk==99 | feetchk==.
(203 observations deleted)

. gen footcheck_d = .
(9,443 missing values generated)

. replace footcheck_d = 1 if feetchk>=2
(7,665 real changes made)

. replace footcheck_d = 0 if feetchk==88 | feetchk==1
(3,940 real changes made)

. tab footcheck_d, missing

footcheck_d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,940       41.72       41.72
          1 |      5,503       58.28      100.00
------------+-----------------------------------
      Total |      9,443      100.00

. *cleaning eye exam var
. tab eyeexam, missing

   LAST EYE |
 EXAM WHERE |
PUPILS WERE |
    DILATED |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,092       22.15       22.15
          2 |      5,312       56.25       78.41
          3 |      1,033       10.94       89.35
          4 |        782        8.28       97.63
          7 |         99        1.05       98.68
          8 |        121        1.28       99.96
          9 |          4        0.04      100.00
------------+-----------------------------------
      Total |      9,443      100.00

. drop if eyeexam==7 | eyeexam==9| eyeexam==.
(103 observations deleted)

. gen eyecheck = .
(9,340 missing values generated)

. replace eyecheck = 1 if eyeexam==1 | eyeexam==2
(7,404 real changes made)

. replace eyecheck = 0 if eyeexam==3 | eyeexam==4 | eyeexam==8
(1,936 real changes made)

. tab eyecheck, missing

   eyecheck |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,936       20.73       20.73
          1 |      7,404       79.27      100.00
------------+-----------------------------------
      Total |      9,340      100.00

. *cleaning diabetes education var
. tab diabedu, missing

 EVER TAKEN |
   CLASS IN |
   MANAGING |
   DIABETES |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,289       56.63       56.63
          2 |      4,036       43.21       99.84
          7 |         13        0.14       99.98
          9 |          2        0.02      100.00
------------+-----------------------------------
      Total |      9,340      100.00

. drop if diabedu==7 | diabedu==9 | diabedu==.
(15 observations deleted)

. gen dia_eduction = .
(9,325 missing values generated)

. replace dia_eduction = 1 if diabedu==1
(5,289 real changes made)

. replace dia_eduction = 0 if diabedu==2
(4,036 real changes made)

. tab dia_eduction, missing

dia_eductio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,036       43.28       43.28
          1 |      5,289       56.72      100.00
------------+-----------------------------------
      Total |      9,325      100.00

. *gen variable for optimal care
. egen carescore = rowtotal(glucosetest footcheck controlledbp cholesterol flushot pneumonia a1c diacheck f
> ootcheck_d eyecheck dia_eduction)

. gen adequatecare = .
(9,325 missing values generated)

. replace adequatecare = 0 if carescore>8
(5,872 real changes made)

. replace adequatecare = 1 if carescore<=8
(3,453 real changes made)

. tab adequatecare, missing

adequatecar |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,872       62.97       62.97
          1 |      3,453       37.03      100.00
------------+-----------------------------------
      Total |      9,325      100.00

. *create race/ethnicity var
. tab race2, missing

   COMPUTED |
RACE-ETHNIC |
        ITY |
   GROUPING |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      7,376       79.10       79.10
          2 |      1,101       11.81       90.91
          3 |         38        0.41       91.31
          4 |          3        0.03       91.35
          5 |        120        1.29       92.63
          6 |         45        0.48       93.12
          7 |        116        1.24       94.36
          8 |        404        4.33       98.69
          9 |        121        1.30       99.99
          . |          1        0.01      100.00
------------+-----------------------------------
      Total |      9,325      100.00

. drop if race2==9 | race2==.
(122 observations deleted)

. gen race_eth = .
(9,203 missing values generated)

. replace race_eth = 0 if race2==1 //white
(7,376 real changes made)

. replace race_eth = 1 if race2==2 //black
(1,101 real changes made)

. replace race_eth = 2 if race2==8 // hispanic
(404 real changes made)

. replace race_eth = 3 if race2>=3 & race2<=7 //other or multi
(322 real changes made)

. tab race_eth, missing

   race_eth |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,376       80.15       80.15
          1 |      1,101       11.96       92.11
          2 |        404        4.39       96.50
          3 |        322        3.50      100.00
------------+-----------------------------------
      Total |      9,203      100.00

. *gen physical activity var
. tab _rfpamod, missing

   MODERATE |
   PHYSICAL |
   ACTIVITY |
 CALCULATED |
         VA |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,616       28.43       28.43
          2 |      5,991       65.10       93.52
          9 |        596        6.48      100.00
------------+-----------------------------------
      Total |      9,203      100.00

. drop if _rfpamod==9
(596 observations deleted)

. gen physact = .
(8,607 missing values generated)

. replace physact = 0 if _rfpamod==1
(2,616 real changes made)

. replace physact = 1 if _rfpamod==2
(5,991 real changes made)

. tab physact, missing

    physact |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,616       30.39       30.39
          1 |      5,991       69.61      100.00
------------+-----------------------------------
      Total |      8,607      100.00

. *clean education var
. tab educa, missing

  EDUCATION |
      LEVEL |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         19        0.22        0.22
          2 |        497        5.77        6.00
          3 |        878       10.20       16.20
          4 |      3,281       38.12       54.32
          5 |      2,174       25.26       79.57
          6 |      1,751       20.34       99.92
          9 |          7        0.08      100.00
------------+-----------------------------------
      Total |      8,607      100.00

. drop if educa==9 | educa==.
(7 observations deleted)

. gen education = .
(8,600 missing values generated)

. replace education = 1 if educa==1 | educa==2 | educa==3
(1,394 real changes made)

. replace education = 2 if educa==4 | educa==5
(5,455 real changes made)

. replace education = 0 if educa==6
(1,751 real changes made)

. tab education, missing

  education |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,751       20.36       20.36
          1 |      1,394       16.21       36.57
          2 |      5,455       63.43      100.00
------------+-----------------------------------
      Total |      8,600      100.00

. *clean annual household income var
. tab income2

     INCOME |
      LEVEL |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        519        6.04        6.04
          2 |        860       10.00       16.04
          3 |      1,019       11.85       27.89
          4 |      1,241       14.43       42.32
          5 |      1,283       14.92       57.24
          6 |      1,098       12.77       70.01
          7 |        704        8.19       78.20
          8 |        630        7.33       85.52
         77 |        630        7.33       92.85
         99 |        615        7.15      100.00
------------+-----------------------------------
      Total |      8,599      100.00

. drop if income2==77 | income2==99 | income2==.
(1,246 observations deleted)

. gen income = .
(7,354 missing values generated)

. replace income = 0 if income2>=6
(2,432 real changes made)

. replace income = 1 if income2<6
(4,922 real changes made)

. tab income, missing

     income |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      2,432       33.07       33.07
          1 |      4,922       66.93      100.00
------------+-----------------------------------
      Total |      7,354      100.00

. *clean marital status var
. tab marital, missing

    MARITAL |
     STATUS |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      3,327       45.24       45.24
          2 |      1,011       13.75       58.99
          3 |      2,545       34.61       93.60
          4 |         89        1.21       94.81
          5 |        341        4.64       99.44
          6 |         33        0.45       99.89
          9 |          8        0.11      100.00
------------+-----------------------------------
      Total |      7,354      100.00

. drop if marital==9 | marital==.
(8 observations deleted)

. gen marstatus = .
(7,346 missing values generated)

. replace marstatus = 0 if marital==1 | marital==4
(3,416 real changes made)

. replace marstatus = 1 if marital==2 | marital==3 | marital==5 | marital==6
(3,930 real changes made)

. tab marstatus, missing

  marstatus |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,416       46.50       46.50
          1 |      3,930       53.50      100.00
------------+-----------------------------------
      Total |      7,346      100.00

. *clean self reported health status var
. tab genhlth, missing

    GENERAL |
     HEALTH |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        195        2.65        2.65
          2 |      1,063       14.47       17.12
          3 |      2,683       36.52       53.65
          4 |      2,190       29.81       83.46
          5 |      1,169       15.91       99.37
          7 |         16        0.22       99.59
          9 |         30        0.41      100.00
------------+-----------------------------------
      Total |      7,346      100.00

. drop if genhlth==7 | genhlth==9 | genhlth==.
(46 observations deleted)

. gen srh = .
(7,300 missing values generated)

. replace srh = 1 if genhlth==4 | genhlth==5
(3,359 real changes made)

. replace srh = 0 if genhlth<=3
(3,941 real changes made)

. tab srh, missing

        srh |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,941       53.99       53.99
          1 |      3,359       46.01      100.00
------------+-----------------------------------
      Total |      7,300      100.00

. *clean health care professional var
. tab persdoc2, missing

   MULTIPLE |
HEALTH CARE |
PROFESSIONA |
         LS |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,254       85.67       85.67
          2 |        851       11.66       97.33
          3 |        189        2.59       99.92
          7 |          4        0.05       99.97
          9 |          2        0.03      100.00
------------+-----------------------------------
      Total |      7,300      100.00

. drop if persdoc2==7 | persdoc2==9 | persdoc2==.
(6 observations deleted)

. gen provider = .
(7,294 missing values generated)

. replace provider = 0 if persdoc2==1 | persdoc2==2
(7,105 real changes made)

. replace provider = 1 if persdoc2==3
(189 real changes made)

. tab provider, missing

   provider |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,105       97.41       97.41
          1 |        189        2.59      100.00
------------+-----------------------------------
      Total |      7,294      100.00

. *clean bmi var
. tab _bmi4cat, missing

   COMPUTED |
  BODY MASS |
      INDEX |
 CATEGORIES |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,098       15.05       15.05
          2 |      2,615       35.85       50.90
          3 |      3,403       46.65       97.56
          9 |        178        2.44      100.00
------------+-----------------------------------
      Total |      7,294      100.00

. drop if _bmi4cat==9
(178 observations deleted)

. gen bmi = .
(7,116 missing values generated)

. replace bmi = 0 if _bmi4cat==1
(1,098 real changes made)

. replace bmi = 1 if _bmi4cat==2
(2,615 real changes made)

. replace bmi = 2 if _bmi4cat==3
(3,403 real changes made)

. tab bmi, missing

        bmi |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,098       15.43       15.43
          1 |      2,615       36.75       52.18
          2 |      3,403       47.82      100.00
------------+-----------------------------------
      Total |      7,116      100.00

. *clean smoking var
. tab _rfsmok3, missing

    CURRENT |
    SMOKING |
 CALCULATED |
   VARIABLE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,536       91.85       91.85
          2 |        561        7.88       99.73
          9 |         19        0.27      100.00
------------+-----------------------------------
      Total |      7,116      100.00

. drop if _rfsmok3==9
(19 observations deleted)

. gen smoker = .
(7,097 missing values generated)

. replace smoker = 1 if _rfsmok3==2
(561 real changes made)

. replace smoker = 0 if _rfsmok3==1
(6,536 real changes made)

. tab smoker, missing

     smoker |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,536       92.10       92.10
          1 |        561        7.90      100.00
------------+-----------------------------------
      Total |      7,097      100.00

. *clean routine checkup var
. tab checkup1, missing

  LENGTH OF |
 TIME SINCE |
       LAST |
    ROUTINE |
     CHECKU |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,489       91.43       91.43
          2 |        302        4.26       95.69
          3 |        111        1.56       97.25
          4 |        123        1.73       98.99
          7 |         50        0.70       99.69
          8 |         21        0.30       99.99
          9 |          1        0.01      100.00
------------+-----------------------------------
      Total |      7,097      100.00

. drop if checkup1==7 | checkup1==9 | checkup1==8
(72 observations deleted)

. gen routine_checkup = .
(7,025 missing values generated)

. replace routine_checkup = 0 if checkup1==1
(6,489 real changes made)

. replace routine_checkup = 1 if checkup>1
(536 real changes made)

. tab routine_checkup, missing

routine_che |
       ckup |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      6,489       92.37       92.37
          1 |        536        7.63      100.00
------------+-----------------------------------
      Total |      7,025      100.00

. *clean insulin use var
. tab insulin, missing

 NOW TAKING |
    INSULIN |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,912       27.22       27.22
          2 |      5,102       72.63       99.84
          9 |         11        0.16      100.00
------------+-----------------------------------
      Total |      7,025      100.00

. drop if insulin==9 | insulin==.
(11 observations deleted)

. gen insulin_use = .
(7,014 missing values generated)

. replace insulin_use = 1 if insulin==1
(1,912 real changes made)

. replace insulin_use = 0 if insulin==2
(5,102 real changes made)

. tab insulin_use, missing

insulin_use |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,102       72.74       72.74
          1 |      1,912       27.26      100.00
------------+-----------------------------------
      Total |      7,014      100.00

. *clean affect eyes var
. tab diabeye, missing

  EVER TOLD |
   DIABETES |
        HAS |
   AFFECTED |
       EYES |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,375       19.60       19.60
          2 |      5,562       79.30       98.90
          7 |         77        1.10      100.00
------------+-----------------------------------
      Total |      7,014      100.00

. drop if diabeye==7 | diabeye==9 | diabeye==.
(77 observations deleted)

. gen affect_eyes = .
(6,937 missing values generated)

. replace affect_eyes = 1 if diabeye==1
(1,375 real changes made)

. replace affect_eyes = 0 if diabeye==2
(5,562 real changes made)

. tab affect_eyes, missing

affect_eyes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,562       80.18       80.18
          1 |      1,375       19.82      100.00
------------+-----------------------------------
      Total |      6,937      100.00

. *clean sex var (only missing dropped)
. tab sex, missing

RESPONDENTS |
        SEX |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      2,893       41.70       41.70
          2 |      4,044       58.30      100.00
------------+-----------------------------------
      Total |      6,937      100.00

. *clean insurance var (only missing dropped)
. tab hlthplan, missing

   HAVE ANY |
HEALTH CARE |
   COVERAGE |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,827       98.41       98.41
          2 |        108        1.56       99.97
          7 |          2        0.03      100.00
------------+-----------------------------------
      Total |      6,937      100.00

. drop if hlthplan==7 | hlthplan==9
(2 observations deleted)

. *clean deferment var (only missing dropped)
. tab medcost, missing

  COULD NOT |
    SEE DR. |
 BECAUSE OF |
       COST |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        388        5.59        5.59
          2 |      6,541       94.32       99.91
          7 |          4        0.06       99.97
          9 |          2        0.03      100.00
------------+-----------------------------------
      Total |      6,935      100.00

. drop if medcost==7 | medcost==9
(6 observations deleted)

. *clean age of onset var
. tab diabage2, missing

   AGE WHEN |
       TOLD |
   DIABETIC |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        0.06        0.06
          5 |          2        0.03        0.09
          7 |          2        0.03        0.12
          8 |          2        0.03        0.14
         10 |          1        0.01        0.16
         11 |          2        0.03        0.19
         12 |          1        0.01        0.20
         13 |          1        0.01        0.22
         14 |          1        0.01        0.23
         15 |          8        0.12        0.35
         16 |          1        0.01        0.36
         18 |          6        0.09        0.45
         19 |          7        0.10        0.55
         20 |         11        0.16        0.71
         21 |          4        0.06        0.76
         22 |          4        0.06        0.82
         23 |          4        0.06        0.88
         24 |          5        0.07        0.95
         25 |         11        0.16        1.11
         26 |          5        0.07        1.18
         27 |          9        0.13        1.31
         28 |         11        0.16        1.47
         29 |          6        0.09        1.56
         30 |         55        0.79        2.35
         31 |          4        0.06        2.41
         32 |         13        0.19        2.60
         33 |         11        0.16        2.76
         34 |          6        0.09        2.84
         35 |         61        0.88        3.72
         36 |         14        0.20        3.93
         37 |         16        0.23        4.16
         38 |         20        0.29        4.45
         39 |         22        0.32        4.76
         40 |        190        2.74        7.50
         41 |         13        0.19        7.69
         42 |         50        0.72        8.41
         43 |         32        0.46        8.88
         44 |         19        0.27        9.15
         45 |        182        2.63       11.78
         46 |         25        0.36       12.14
         47 |         32        0.46       12.60
         48 |         54        0.78       13.38
         49 |         29        0.42       13.80
         50 |        521        7.52       21.32
         51 |         33        0.48       21.79
         52 |        104        1.50       23.29
         53 |         53        0.76       24.06
         54 |         65        0.94       25.00
         55 |        462        6.67       31.66
         56 |         80        1.15       32.82
         57 |         82        1.18       34.00
         58 |        176        2.54       36.54
         59 |        104        1.50       38.04
         60 |        675        9.74       47.78
         61 |         96        1.39       49.17
         62 |        268        3.87       53.04
         63 |        190        2.74       55.78
         64 |        185        2.67       58.45
         65 |        560        8.08       66.53
         66 |        157        2.27       68.80
         67 |        161        2.32       71.12
         68 |        202        2.92       74.04
         69 |        164        2.37       76.40
         70 |        398        5.74       82.15
         71 |        101        1.46       83.61
         72 |        144        2.08       85.68
         73 |         91        1.31       87.00
         74 |         80        1.15       88.15
         75 |        197        2.84       90.99
         76 |         64        0.92       91.92
         77 |         48        0.69       92.61
         78 |         68        0.98       93.59
         79 |         47        0.68       94.27
         80 |         79        1.14       95.41
         81 |         29        0.42       95.83
         82 |         25        0.36       96.19
         83 |         18        0.26       96.45
         84 |         12        0.17       96.62
         85 |         24        0.35       96.97
         86 |          8        0.12       97.08
         87 |          5        0.07       97.16
         88 |          5        0.07       97.23
         89 |          1        0.01       97.24
         90 |          4        0.06       97.30
         93 |          2        0.03       97.33
         98 |        176        2.54       99.87
         99 |          9        0.13      100.00
------------+-----------------------------------
      Total |      6,929      100.00

. drop if diabage2==98 | diabage2==99 | diabage2==.
(185 observations deleted)

. gen age_onset = .
(6,744 missing values generated)

. replace age_onset = 0 if diabage2<45
(634 real changes made)

. replace age_onset = 1 if diabage2>=45 & diabage2<=64
(3,416 real changes made)

. replace age_onset = 2 if diabage2>=65
(2,694 real changes made)

. tab age_onset, missing

  age_onset |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        634        9.40        9.40
          1 |      3,416       50.65       60.05
          2 |      2,694       39.95      100.00
------------+-----------------------------------
      Total |      6,744      100.00

. **************************************
. ** Recreate Table 1: demographic summary        
. **************************************
. foreach var in sex race_eth education marstatus income hlthplan medcost  provider routine_checkup srh {
  2.         display "Proportion `var'"
  3.         svy: proportion `var' if rural==0
  4.         svy: proportion `var' if rural==1
  5. }
Proportion sex
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         sex |
          1  |   .4931377   .0120602      .4695258    .5167803
          2  |   .5068623   .0120602      .4832197    .5304742
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         sex |
          1  |   .4927269   .0181305      .4572659    .5282612
          2  |   .5072731   .0181305      .4717388    .5427341
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion race_eth
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    race_eth |
          0  |   .7296882   .0115906      .7063728    .7518027
          1  |   .1681229   .0098404      .1497028    .1883077
          2  |   .0635244   .0084077      .0489025    .0821408
          3  |   .0386644   .0050456         .0299    .0498659
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    race_eth |
          0  |    .862728   .0138243      .8333006    .8876609
          1  |    .079249    .011957      .0587473    .1060988
          2  |   .0319495   .0077091       .019841    .0510625
          3  |   .0260736   .0043849      .0187236    .0362023
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion education
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
   education |
          0  |   .2563866   .0109674      .2354809    .2784723
          1  |     .13803   .0080532      .1229859    .1545899
          2  |   .6055834   .0118374      .5821536    .6285378
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
   education |
          0  |    .153147    .012166      .1307776    .1785567
          1  |   .1861535   .0143746        .15959    .2160021
          2  |   .6606995   .0167809      .6270556    .6927953
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion marstatus
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
   marstatus |
          0  |   .5739676   .0116655      .5509543     .596665
          1  |   .4260324   .0116655       .403335    .4490457
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
   marstatus |
          0  |   .6314799   .0160851      .5994115     .662427
          1  |   .3685201   .0160851       .337573    .4005885
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion income
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      income |
          0  |   .4094621   .0116248      .3868804    .4324323
          1  |   .5905379   .0116248      .5675677    .6131196
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
      income |
          0  |   .3081229   .0167261      .2763214    .3418555
          1  |   .6918771   .0167261      .6581445    .7236786
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion hlthplan
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    hlthplan |
          1  |   .9856216   .0027696      .9790489    .9901531
          2  |   .0143784   .0027696      .0098469    .0209511
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    hlthplan |
          1  |   .9781306   .0066528      .9604795    .9879967
          2  |   .0218694   .0066528      .0120033    .0395205
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion medcost
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
     medcost |
          1  |   .0555765   .0055098      .0457112    .0674204
          2  |   .9444235   .0055098      .9325796    .9542888
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
     medcost |
          1  |   .0461257   .0063084      .0352177    .0602015
          2  |   .9538743   .0063084      .9397985    .9647823
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion provider
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    provider |
          0  |   .9776793   .0039145      .9685677    .9841928
          1  |   .0223207   .0039145      .0158072    .0314323
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
    provider |
          0  |   .9640923   .0076769      .9455933    .9764579
          1  |   .0359077   .0076769      .0235421    .0544067
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
Proportion routine_checkup
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513              Number of obs   =     4,470
Number of PSUs   = 4,470              Population size = 1,685,767
                                      Design df       =     3,957

-----------------------------------------------------------------
                |             Linearized            Logit
                | Proportion   std. err.     [95% conf. interval]
----------------+------------------------------------------------
routine_checkup |
             0  |   .9327316    .005598      .9208902    .9429104
             1  |   .0672684    .005598      .0570896    .0791098
-----------------------------------------------------------------
Note: Strata with single sampling unit centered at overall mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342             Number of obs   =      2,274
Number of PSUs   = 2,274             Population size = 493,638.74
                                     Design df       =      1,932

-----------------------------------------------------------------
                |             Linearized            Logit
                | Proportion   std. err.     [95% conf. interval]
----------------+------------------------------------------------
routine_checkup |
             0  |   .9216434   .0101932      .8991732    .9394431
             1  |   .0783566   .0101932      .0605569    .1008268
-----------------------------------------------------------------
Note: Strata with single sampling unit centered at overall mean.
Proportion srh
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   513           Number of obs   =     4,470
Number of PSUs   = 4,470           Population size = 1,685,767
                                   Design df       =     3,957

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         srh |
          0  |   .5784291   .0114737      .5557864    .6007467
          1  |   .4215709   .0114737      .3992533    .4442136
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.
(running proportion on estimation sample)

Survey: Proportion estimation

Number of strata =   342          Number of obs   =      2,274
Number of PSUs   = 2,274          Population size = 493,638.74
                                  Design df       =      1,932

--------------------------------------------------------------
             |             Linearized            Logit
             | Proportion   std. err.     [95% conf. interval]
-------------+------------------------------------------------
         srh |
          0  |   .5037355   .0180798      .4683181    .5391155
          1  |   .4962645   .0180798      .4608845    .5316819
--------------------------------------------------------------
Note: Strata with single sampling unit centered at overall
      mean.

. 
. **************************************
. ** Recreate Table 3: multivariate reg           
. **************************************
. svy: logistic adequatecare rural ib2.sex i.race_eth i.education marstatus income srh i.age_onset insulin_
> use i.bmi physact smoker ib2.hlthplan i.medcost provider routine_checkup
(running logistic on estimation sample)

Survey: Logistic regression

Number of strata =   724                           Number of obs   =     6,744
Number of PSUs   = 6,744                           Population size = 2,179,406
                                                   Design df       =     6,020
                                                   F(21, 6000)     =      8.93
                                                   Prob > F        =    0.0000

---------------------------------------------------------------------------------
                |             Linearized
   adequatecare | Odds ratio   std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rural |   1.316547   .1221112     2.97   0.003     1.097666    1.579072
          1.sex |   1.370193   .1277197     3.38   0.001      1.14136    1.644905
                |
       race_eth |
             1  |   .9658275   .1481305    -0.23   0.821     .7150282    1.304596
             2  |   1.486372   .3978675     1.48   0.139     .8794979    2.512004
             3  |   1.427355   .3542597     1.43   0.152     .8774597    2.321864
                |
      education |
             1  |   1.852244   .3074984     3.71   0.000     1.337699    2.564709
             2  |   1.421909   .1697627     2.95   0.003     1.125189    1.796874
                |
      marstatus |   1.053214   .0997771     0.55   0.584     .8747036    1.268154
         income |   1.141002   .1191723     1.26   0.207     .9297462    1.400258
            srh |   .7686315    .071809    -2.82   0.005     .6399987    .9231181
                |
      age_onset |
             1  |   1.078875   .1804625     0.45   0.650     .7772536    1.497544
             2  |   1.235681   .2091886     1.25   0.211     .8867012    1.722009
                |
    insulin_use |    .424227   .0510204    -7.13   0.000     .3351248    .5370195
                |
            bmi |
             1  |   .8411407    .107215    -1.36   0.175      .655163    1.079911
             2  |   .7035283   .0883747    -2.80   0.005     .5499652    .8999699
                |
        physact |   1.073127   .1009816     0.75   0.453     .8923531    1.290523
         smoker |   1.369951   .2157526     2.00   0.046     1.006058    1.865465
     1.hlthplan |   1.052343   .3636101     0.15   0.883     .5345486    2.071702
      2.medcost |   .5776952   .1010866    -3.14   0.002     .4099428    .8140933
       provider |   1.939785   .6207113     2.07   0.038     1.035912     3.63232
routine_checkup |   1.844586    .280488     4.03   0.000     1.369112    2.485186
          _cons |   .6614772   .2962179    -0.92   0.356     .2749536    1.591367
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
Note: Strata with single sampling unit centered at overall mean.

. 
. svy: logistic adequatecare rural ib2.sex i.race_eth i.education marstatus income srh i.age_onset insulin_
> use i.bmi physact smoker ib2.hlthplan ib2.medcost provider routine_checkup if rural==1
(running logistic on estimation sample)

note: rural omitted because of collinearity.

Survey: Logistic regression

Number of strata =   342                          Number of obs   =      2,274
Number of PSUs   = 2,274                          Population size = 493,638.74
                                                  Design df       =      1,932
                                                  F(20, 1913)     =       3.15
                                                  Prob > F        =     0.0000

---------------------------------------------------------------------------------
                |             Linearized
   adequatecare | Odds ratio   std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rural |          1  (omitted)
          1.sex |   1.550103   .2514682     2.70   0.007     1.127681    2.130762
                |
       race_eth |
             1  |   1.355777   .4739695     0.87   0.384     .6830111    2.691215
             2  |   1.092047     .47331     0.20   0.839     .4667522    2.555033
             3  |    .678973    .250121    -1.05   0.293     .3296774     1.39835
                |
      education |
             1  |   1.745522   .4656667     2.09   0.037      1.03443    2.945435
             2  |   1.331014    .276887     1.37   0.169     .8851132    2.001551
                |
      marstatus |   1.043584   .1732406     0.26   0.797     .7535897    1.445174
         income |    1.02689   .1888314     0.14   0.885     .7159806     1.47281
            srh |   .7475175   .1172515    -1.86   0.064     .5495698    1.016763
                |
      age_onset |
             1  |   .7336934   .2131899    -1.07   0.287     .4149782    1.297191
             2  |   .7229244   .2098109    -1.12   0.264     .4091644    1.277285
                |
    insulin_use |   .4489258   .0839127    -4.28   0.000     .3111496    .6477089
                |
            bmi |
             1  |   .7610479   .1696047    -1.23   0.221     .4915832    1.178222
             2  |   .6634114   .1453106    -1.87   0.061     .4317405    1.019396
                |
        physact |   1.052536   .1693809     0.32   0.750     .7676626    1.443124
         smoker |   1.485518   .3962571     1.48   0.138     .8804002    2.506545
     1.hlthplan |   .5451835    .349985    -0.94   0.345     .1547976    1.920087
      1.medcost |    1.21557   .3538989     0.67   0.503     .6867632    2.151556
       provider |   1.764385   .8099383     1.24   0.216     .7171426    4.340913
routine_checkup |   2.313074   .6195893     3.13   0.002     1.367856    3.911459
          _cons |   1.680175   1.273149     0.68   0.494     .3801491    7.426004
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
Note: Strata with single sampling unit centered at overall mean.

. 
. svy: logistic adequatecare rural ib2.sex i.race_eth i.education marstatus income srh i.age_onset insulin_
> use i.bmi physact smoker ib2.hlthplan ib2.medcost provider routine_checkup if rural==0
(running logistic on estimation sample)

note: rural omitted because of collinearity.

Survey: Logistic regression

Number of strata =   513                           Number of obs   =     4,470
Number of PSUs   = 4,470                           Population size = 1,685,767
                                                   Design df       =     3,957
                                                   F(20, 3938)     =      6.90
                                                   Prob > F        =    0.0000

---------------------------------------------------------------------------------
                |             Linearized
   adequatecare | Odds ratio   std. err.      t    P>|t|     [95% conf. interval]
----------------+----------------------------------------------------------------
          rural |          1  (omitted)
          1.sex |   1.322436   .1481217     2.50   0.013     1.061708    1.647192
                |
       race_eth |
             1  |   .9166162   .1533486    -0.52   0.603     .6602968    1.272436
             2  |    1.54982   .4715175     1.44   0.150     .8535567    2.814039
             3  |   1.663086   .4728236     1.79   0.074     .9524447    2.903953
                |
      education |
             1  |   1.943821   .3864186     3.34   0.001      1.31641     2.87026
             2  |   1.449128   .2017279     2.66   0.008     1.103006    1.903863
                |
      marstatus |   1.059977   .1198792     0.52   0.607     .8491799    1.323103
         income |    1.17531   .1456496     1.30   0.192     .9217977    1.498544
            srh |   .7674291   .0861774    -2.36   0.018     .6157784    .9564274
                |
      age_onset |
             1  |   1.235541   .2412656     1.08   0.279     .8425414    1.811854
             2  |   1.464825   .2931883     1.91   0.057     .9893807    2.168742
                |
    insulin_use |   .4072368    .059677    -6.13   0.000     .3055433    .5427768
                |
            bmi |
             1  |   .8660883   .1301323    -0.96   0.339     .6451007    1.162778
             2  |   .7079289   .1049413    -2.33   0.020     .5293847    .9466902
                |
        physact |   1.079435   .1222954     0.67   0.500     .8644294    1.347918
         smoker |   1.338831   .2560432     1.53   0.127     .9202144    1.947882
     1.hlthplan |   1.446651   .5450567     0.98   0.327     .6911262      3.0281
      1.medcost |    1.90276   .3833627     3.19   0.001      1.28184    2.824451
       provider |   2.085851   .8634975     1.78   0.076     .9263949    4.696456
routine_checkup |   1.816833   .3335404     3.25   0.001     1.267653     2.60393
          _cons |   .2343575   .1100641    -3.09   0.002     .0933248    .5885196
---------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
Note: Strata with single sampling unit centered at overall mean.

. 
. log close
      name:  <unnamed>
       log:  C:\Users\eshak\OneDrive\Documents\23 Fall\Large Scale Data\finalproject2009.log
  log type:  text
 closed on:   6 Dec 2023, 15:07:34
-----------------------------------------------------------------------------------------------------------
